package com.alevel.homework1;

public class Equation {
    public static void main(String[] args) {
// Pseudo code
//        Задача. Найти корни квадратного(или биквадратного) уравнения.
//
//        0 Получить уравнение
//        1 ЕСЛИ уравнение биквадратное
//        2     заменить x^2 на y
//        3 Вычленить из строки значение a
//        4 Вычленить из строки значение b
//        5 Вычленить из строки значение c
//        6 Подсчитать дискриминант
//        7     ЕСЛИ дискриминант больше 0
//        8         вычислить x1
//        9         вычислить x2
//        10         ЕСЛИ уравнение биквадратное
//        11             вычислить корни из x1 и x2
//        12     ИНАЧЕ ЕСЛИ дискриминант равен 0
//        13         вычислить х1 == х2 (b/2a)
//        14         ЕСЛИ уравнение биквадратное
//        15            вычислить корень из х1 == х2
//        16    ИНАЧЕ дискриминант меньше 0
//        17         завершаем решение уравнения т.к. нет корней
    }
}
