package com.alevel.homework1;

public class TriangleArea {
    public static void main(String[] args) {
// Pseudo code
//        0 Получить координаты вершин А, В и С
//        1 ЕСЛИ все три точки заданы
//        2    ЕСЛИ две или более вершин совпадают по координатам
//        3        плошадь будет 0
//        4    ИНАЧЕ ЕСЛИ точки преобразуют прямую
//        5         плошадь будет 0
//        6    ИНАЧЕ вычислить площадь треугольника через определитель второго порядка для матрицы разниц координат
    }
}
